ErichStyger/MetaClockClock/Firmware/LPC845_Clock4/board/boards/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: LPC845
package_id: LPC845M301JBD48
mcu_data: ksdk2_0
processor_version: 24.12.10
board: LPC845BREAKOUT
pin_labels:
- {pin_num: '11', pin_signal: PIO1_0/CAPT_X1, label: M2_STEP, identifier: M2_STEP}
- {pin_num: '14', pin_signal: PIO1_1/CAPT_X2, label: MAG_M0, identifier: MAG_M0}
- {pin_num: '16', pin_signal: PIO1_2/CAPT_X3, label: MAG_M6, identifier: MAG_M6}
- {pin_num: '1', pin_signal: PIO1_8/CAPT_YL, label: M1_STEP, identifier: CAPY_LOW;M3_STEP;M1_STEP}
- {pin_num: '2', pin_signal: PIO0_13/ADC_10, label: M1_DIR, identifier: M3_DIR;M1_DIR}
- {pin_num: '3', pin_signal: PIO1_9/CAPT_YH, label: M0_DIR, identifier: CAPY_HIGH;M0_DIR}
- {pin_num: '4', pin_signal: PIO0_12, label: M0_STEP, identifier: K1;M0_STEP}
- {pin_num: '6', pin_signal: PIO0_4/ADC_11, label: M2_DIR, identifier: K3;M1_DIR;M2_DIR}
- {pin_num: '7', pin_signal: PIO0_28/WKTCLKIN, label: M2_STEP, identifier: M1_STEP;M2_STEP}
- {pin_num: '9', pin_signal: PIO0_31/CAPT_X0, label: MAG_M1, identifier: CAPX;MAG_M1}
- {pin_num: '12', pin_signal: PIO0_11/I2C0_SDA, label: M2_DIR, identifier: M2_DIR}
- {pin_num: '13', pin_signal: PIO0_10/I2C0_SCL}
- {pin_num: '15', pin_signal: PIO0_16, label: MAG_M7, identifier: MAG_M7}
- {pin_num: '17', pin_signal: PIO0_27, label: M3_DIR, identifier: M3_DIR;M2_DIR}
- {pin_num: '18', pin_signal: PIO0_26, label: M3_STEP, identifier: M3_STEP}
- {pin_num: '23', pin_signal: PIO1_4/CAPT_X5, label: PIO1_4/CAPT_X5, identifier: RS485_TXRX_EN}
- {pin_num: '25', pin_signal: PIO0_9/XTALOUT, label: M6_STEP, identifier: M5_STEP;M6_STEP}
- {pin_num: '26', pin_signal: PIO0_8/XTALIN, label: M6_DIR, identifier: M5_DIR;M6_DIR}
- {pin_num: '27', pin_signal: PIO1_5/CAPT_X6, label: M7_DIR, identifier: M6_DIR;M7_DIR}
- {pin_num: '28', pin_signal: PIO1_6/CAPT_X7, label: M7_STEP, identifier: M6_STEP;M7_STEP}
- {pin_num: '33', pin_signal: PIO0_7/ADC_0, label: M5_STEP, identifier: M7_STEP;M5_STEP}
- {pin_num: '34', pin_signal: PIO0_6/ADC_1/ACMPVREF, label: M5_DIR, identifier: M7_DIR;M5_DIR}
- {pin_num: '35', pin_signal: PIO1_7/CAPT_X8, label: M4_STEP, identifier: M4_STEP}
- {pin_num: '36', pin_signal: PIO0_0/ACMP_I1, label: M4_DIR, identifier: M4_DIR}
- {pin_num: '38', pin_signal: PIO0_29/DACOUT_1, label: MAG_M5, identifier: MAG_M5}
- {pin_num: '39', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: MAG_M4, identifier: MAG_M4}
- {pin_num: '47', pin_signal: PIO0_18/ADC_8, label: MAG_M3, identifier: MAG_M3}
- {pin_num: '48', pin_signal: PIO0_17/ADC_9/DACOUT_0, label: MAG_M2, identifier: MAG_M2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitSWD_DEBUGPins();
    BOARD_InitRS485();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSWD_DEBUGPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '8', peripheral: SWD, signal: SWCLK, pin_signal: SWCLK/PIO0_3, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
  - {pin_num: '10', peripheral: SWD, signal: SWDIO, pin_signal: SWDIO/PIO0_2, mode: pullUp, invert: disabled, hysteresis: enabled, opendrain: disabled, smode: bypass,
    clkdiv: div0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSWD_DEBUGPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitSWD_DEBUGPins(void)
{
    /* Enables clock for IOCON.: enable */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables clock for switch matrix.: enable */
    CLOCK_EnableClock(kCLOCK_Swm);

    const uint32_t IOCON_INDEX_PIO0_2_config = (/* Selects pull-up function */
                                                IOCON_PIO_MODE_PULLUP |
                                                /* Enable hysteresis */
                                                IOCON_PIO_HYS_EN |
                                                /* Input not invert */
                                                IOCON_PIO_INV_DI |
                                                /* Disables Open-drain function */
                                                IOCON_PIO_OD_DI |
                                                /* Bypass input filter */
                                                IOCON_PIO_SMODE_BYPASS |
                                                /* IOCONCLKDIV0 */
                                                IOCON_PIO_CLKDIV0);
    /* PIO0 PIN2 (coords: 10) is configured as SWD, SWDIO. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_2, IOCON_INDEX_PIO0_2_config);

