ErichStyger/MetaClockClock/Firmware/LPC845_Clock4/board/boards/pin_mux.c
    const uint32_t IOCON_INDEX_PIO0_3_config = (/* Selects pull-up function */
                                                IOCON_PIO_MODE_PULLUP |
                                                /* Enable hysteresis */
                                                IOCON_PIO_HYS_EN |
                                                /* Input not invert */
                                                IOCON_PIO_INV_DI |
                                                /* Disables Open-drain function */
                                                IOCON_PIO_OD_DI |
                                                /* Bypass input filter */
                                                IOCON_PIO_SMODE_BYPASS |
                                                /* IOCONCLKDIV0 */
                                                IOCON_PIO_CLKDIV0);
    /* PIO0 PIN3 (coords: 8) is configured as SWD, SWCLK. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_3, IOCON_INDEX_PIO0_3_config);

    /* SWCLK connect to P0_3 */
    SWM_SetFixedPinSelect(SWM0, kSWM_SWCLK, true);

    /* SWDIO connect to P0_2 */
    SWM_SetFixedPinSelect(SWM0, kSWM_SWDIO, true);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMagPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '14', peripheral: GPIO, signal: 'PIO1, 1', pin_signal: PIO1_1/CAPT_X2, direction: INPUT}
  - {pin_num: '48', peripheral: GPIO, signal: 'PIO0, 17', pin_signal: PIO0_17/ADC_9/DACOUT_0, direction: INPUT}
  - {pin_num: '47', peripheral: GPIO, signal: 'PIO0, 18', pin_signal: PIO0_18/ADC_8, direction: INPUT}
  - {pin_num: '39', peripheral: GPIO, signal: 'PIO0, 23', pin_signal: PIO0_23/ADC_3/ACMP_I4, direction: INPUT}
  - {pin_num: '38', peripheral: GPIO, signal: 'PIO0, 29', pin_signal: PIO0_29/DACOUT_1, direction: INPUT}
  - {pin_num: '16', peripheral: GPIO, signal: 'PIO1, 2', pin_signal: PIO1_2/CAPT_X3, direction: INPUT}
  - {pin_num: '15', peripheral: GPIO, signal: 'PIO0, 16', pin_signal: PIO0_16, direction: INPUT}
  - {pin_num: '9', peripheral: GPIO, signal: 'PIO0, 31', pin_signal: PIO0_31/CAPT_X0, identifier: MAG_M1, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMagPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitMagPins(void)
{
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);
    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t MAG_M7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 15)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M7_GPIO, BOARD_INITMAGPINS_MAG_M7_PORT, BOARD_INITMAGPINS_MAG_M7_PIN, &MAG_M7_config);

    gpio_pin_config_t MAG_M2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 48)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M2_GPIO, BOARD_INITMAGPINS_MAG_M2_PORT, BOARD_INITMAGPINS_MAG_M2_PIN, &MAG_M2_config);

    gpio_pin_config_t MAG_M3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 47)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M3_GPIO, BOARD_INITMAGPINS_MAG_M3_PORT, BOARD_INITMAGPINS_MAG_M3_PIN, &MAG_M3_config);

    gpio_pin_config_t MAG_M4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 39)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M4_GPIO, BOARD_INITMAGPINS_MAG_M4_PORT, BOARD_INITMAGPINS_MAG_M4_PIN, &MAG_M4_config);

    gpio_pin_config_t MAG_M5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin 38)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M5_GPIO, BOARD_INITMAGPINS_MAG_M5_PORT, BOARD_INITMAGPINS_MAG_M5_PIN, &MAG_M5_config);

    gpio_pin_config_t MAG_M1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_31 (pin 9)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M1_GPIO, BOARD_INITMAGPINS_MAG_M1_PORT, BOARD_INITMAGPINS_MAG_M1_PIN, &MAG_M1_config);

    gpio_pin_config_t MAG_M0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_1 (pin 14)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M0_GPIO, BOARD_INITMAGPINS_MAG_M0_PORT, BOARD_INITMAGPINS_MAG_M0_PIN, &MAG_M0_config);

    gpio_pin_config_t MAG_M6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 16)  */
    GPIO_PinInit(BOARD_INITMAGPINS_MAG_M6_GPIO, BOARD_INITMAGPINS_MAG_M6_PORT, BOARD_INITMAGPINS_MAG_M6_PIN, &MAG_M6_config);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMotorPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: GPIO, signal: 'PIO1, 9', pin_signal: PIO1_9/CAPT_YH, identifier: M0_DIR, direction: OUTPUT}
  - {pin_num: '1', peripheral: GPIO, signal: 'PIO1, 8', pin_signal: PIO1_8/CAPT_YL, identifier: M1_STEP, direction: OUTPUT}
  - {pin_num: '2', peripheral: GPIO, signal: 'PIO0, 13', pin_signal: PIO0_13/ADC_10, identifier: M1_DIR, direction: OUTPUT}
  - {pin_num: '4', peripheral: GPIO, signal: 'PIO0, 12', pin_signal: PIO0_12, identifier: M0_STEP, direction: OUTPUT}
  - {pin_num: '6', peripheral: GPIO, signal: 'PIO0, 4', pin_signal: PIO0_4/ADC_11, identifier: M2_DIR, direction: OUTPUT}
  - {pin_num: '7', peripheral: GPIO, signal: 'PIO0, 28', pin_signal: PIO0_28/WKTCLKIN, identifier: M2_STEP, direction: OUTPUT}
  - {pin_num: '18', peripheral: GPIO, signal: 'PIO0, 26', pin_signal: PIO0_26, direction: OUTPUT}
  - {pin_num: '17', peripheral: GPIO, signal: 'PIO0, 27', pin_signal: PIO0_27, identifier: M3_DIR, direction: OUTPUT}
  - {pin_num: '36', peripheral: GPIO, signal: 'PIO0, 0', pin_signal: PIO0_0/ACMP_I1, direction: OUTPUT}
  - {pin_num: '35', peripheral: GPIO, signal: 'PIO1, 7', pin_signal: PIO1_7/CAPT_X8, direction: OUTPUT}
  - {pin_num: '34', peripheral: GPIO, signal: 'PIO0, 6', pin_signal: PIO0_6/ADC_1/ACMPVREF, identifier: M5_DIR, direction: OUTPUT}
  - {pin_num: '33', peripheral: GPIO, signal: 'PIO0, 7', pin_signal: PIO0_7/ADC_0, identifier: M5_STEP, direction: OUTPUT}
  - {pin_num: '28', peripheral: GPIO, signal: 'PIO1, 6', pin_signal: PIO1_6/CAPT_X7, identifier: M7_STEP, direction: OUTPUT}
  - {pin_num: '27', peripheral: GPIO, signal: 'PIO1, 5', pin_signal: PIO1_5/CAPT_X6, identifier: M7_DIR, direction: OUTPUT}
  - {pin_num: '26', peripheral: GPIO, signal: 'PIO0, 8', pin_signal: PIO0_8/XTALIN, identifier: M6_DIR, direction: OUTPUT}
  - {pin_num: '25', peripheral: GPIO, signal: 'PIO0, 9', pin_signal: PIO0_9/XTALOUT, identifier: M6_STEP, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

